def f(n):
    sum = 0
    for i in range(1, n + 1):
        sum = sum + i
    return sum

1. Асимптотична оцінка (O-велике):
sum = 0 виконується 1 раз - O(1)
Цикл for проходить n разів
Всередині циклу додавання - O(1)
Загальна складність: n * O(1) = O(n)
Складність у найгіршому випадку - O(n)

2. Результат виконання:
Функція додає числа від 1 до n, що є сумою арифметичної прогресії.
Результат: sum = n * (n + 1) / 2.

3. Оптимізація:
Ми можемо зробити краще : замість циклу, який робить n кроків, використаємо формулу Гаусса для суми арифметичної прогресії:
def f(n):
  return n * (n + 1) // 2
   
Тут вже асимптотична оцінка стає O(1), бо ми робимо лише три операції (додавання, множення, ділення),незалежно від того, наскільки велике n.
