def h(n):
    return f(n) + g(n)

1. Асимптотична оцінка (O-велике):
З 2.10 ми маємо: f(n) = O(n)
З 2.11 ми маємо: g(n) = O(n^2)
Складність суми функцій визначається за правилом:
O(f + g) = O(max(складність f, складність g))
Оскільки n^2 росте швидше за n, то O(n^2 + n) = O(n^2)
Складність у найгіршому випадку - O(n^2)

2. Результат виконання:
Функція повертає суму результатів f(n) та g(n)
f(n) - це сума чисел від 1 до n
g(n) - це сума (i + f(i)) для i від 1 до n
У результаті отримаємо певне число (поліном 3-го степеня від n)

3. Оптимізація:
Ми можемо покращити ситуацію : f(n) можна обчислити за формулою за O(1), функцію g(n) також можна виразити через одну математичну формулу (сума арифметичної прогресії + сума квадратів)
Якщо ми замінимо обидва виклики на математичні формули, складність h(n) стане O(1)

def h(n):
  return (n * (n + 1) * (n + 5)) // 6
