----------------- a -----------------
𝑇(𝑛) = | 𝑂(1),          𝑛 = 0;
       | 𝑇(𝑛 − 1) + 𝑂(1), 𝑛 ≥ 1.

T(n) = T(n - 1) + 1 = T(n - 2) + 2 = ... = T(0) + n = 
       1 + n = O(n) (лінійна складність)

----------------- d -----------------
𝑇(𝑛) = | 𝑂(1),          𝑛 ≤ 𝑎;
       | 𝑎𝑇(𝑛 − 𝑎) + 𝑂(1), 𝑛 > 𝑎.

T(n) = a*T(n-a) + 1 = a*(a*T(n-2a) + 1) + 1 = a^2*T(n-2a) + a + 1 =
       a^3*T(n-3a) + a^2 + a + 1 = ... = a^k * T(base) + (a^k - 1)/(a - 1)
Оскільки кількість кроків k = n/a, головний член — a^(n/a)
T(n) = O(a^(n/a)) (експоненціальна складність)

----------------- g -----------------
𝑇(𝑛) = | 𝑂(1),          𝑛 = 1;
       | 𝑎𝑇(⌊𝑛/𝑎⌋) + 𝑂(1), 𝑛 ≥ 2, 𝑎 ≥ 2.

T(n) = a*T(n/a) + 1 = a*(a*T(n/a^2) + 1) + 1 = a^2*T(n/a^2) + a + 1 =
       ... = a^k * T(1) + (a^k - 1)/(a - 1)
При k = log_a(n), ми маємо a^k = n
T(n) = n * 1 + (n - 1)/(a - 1) = O(n) (лінійна складність)

----------------- h -----------------
𝑇(𝑛) = | 𝑂(1),          𝑛 = 1;
       | 𝑎𝑇(⌊𝑛/𝑎⌋) + 𝑂(𝑛), 𝑛 ≥ 2, 𝑎 ≥ 2.

T(n) = a*T(n/a) + n = a*(a*T(n/a^2) + n/a) + n = a^2*T(n/a^2) + n + n =
       a^2*T(n/a^2) + 2n = ... = a^k * T(1) + k * n
При k = log_a(n), ми маємо a^k = n та k = log_a(n)
T(n) = n * 1 + n * log_a(n) = O(n * log(n)) (лінійно-логарифмічна складність)
